ci-test/loadtests/loadtest.yml
execution:
- concurrency: 3
  ramp-up: 0s
  hold-for: 5s
  scenario: PostUser

- concurrency: 3
  ramp-up: 0s
  hold-for: 5s
  scenario: GetUser

- concurrency: 3
  ramp-up: 0s
  hold-for: 5s
  scenario: GetUserById 

- concurrency: 3
  ramp-up: 0s
  hold-for: 5s
  scenario: PutUser

- concurrency: 3
  ramp-up: 0s
  hold-for: 5s
  scenario: DeleteUser

scenarios:
  PostUser:
    script: PostUser.jmx
  GetUser:
    script: GetUser.jmx
  GetUserById:
    script: GetUserById.jmx    
  PutUser:
    script: PutUser.jmx
  DeleteUser:
    script: DeleteUser.jmx

reporting:
- module: passfail
  criteria:
  - avg-rt of PostUser>40ms, stop as failed
  - avg-rt of GetUser>35ms, stop as failed
  - avg-rt of GetUserById>35ms, stop as failed
  - avg-rt of PutUser>35ms, stop as failed
  - avg-rt of DeleteUser>35ms, stop as failed
  - failures>0%, stop as failed
  
modules:
  local:
    sequential: true